src/Catalogs/инкОрганизации/инкОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкОрганизации</name>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИФНСТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кадровик</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКДП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКОПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпускДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредприятиеМалогоИлиСреднегоБизнеса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.инкРасчетныеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.инкСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКемВыдано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогооблажения</name>
    <type>
      <types>EnumRef.инкСистемаНалогооблажения</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФСС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяцаВыплатыЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/инкОрганизации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить фактический адрес организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьФактическийАдресОрганизации(ЭтотОбъект) Экспорт
	
	ДанныеСтрока = "";
	ПоискСтруктура = Новый Структура;
	ПоискСтруктура.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ФактическийАдресОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискСтруктура);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		ДанныеСтрока = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат ДанныеСтрока;	
	
КонецФункции    

// Функция - Получить юридический адрес организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьЮридическийАдресОрганизации(ЭтотОбъект) Экспорт
	
	ДанныеСтрока = "";
	ПоискСтруктура = Новый Структура;
	ПоискСтруктура.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ЮридическийАдресОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискСтруктура);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		ДанныеСтрока = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат ДанныеСтрока;	
	
КонецФункции    

// Функция - Получить контактный телефон организации
// 
// Возвращаемое значение:
//   - строка 
//
Функция ПолучитьКонтактныйТелефонОрганизации(ЭтотОбъект) Экспорт
	
	КонтактныйТелефон = "";
	ПоискТелефона = Новый Структура;
	ПоискТелефона.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.КонтактныйТелефонОрганизации); 
	
	КонтактнаяИнформацияМассив = ЭтотОбъект.КонтактнаяИнформация.НайтиСтроки(ПоискТелефона);
	
	Для каждого КонтактнаяИнформацияЭлемент Из КонтактнаяИнформацияМассив Цикл
		КонтактныйТелефон = КонтактнаяИнформацияЭлемент.Представление;
	КонецЦикла; 
	
	Возврат КонтактныйТелефон;	
	
КонецФункции    

// Функция - Получает первую не помеченную на удаление организацию:
// 
// Возвращаемое значение:
//   - Ссылка - Справочник "Организации" 
//
Функция ПолучитьТекущуюОрганизацию() Экспорт
	
	ОрганизацияСсылка = Справочники.инкОрганизации.ПустаяСсылка();

	ОрганизацииТаблица = ПолучитьСписокОрганизаций();
	Если ОрганизацииТаблица.Количество() > 0 Тогда
		ОрганизацияСсылка = ОрганизацииТаблица[0].Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияСсылка;
	
КонецФункции

// Функция - Получить единственную организацию
// 
// Возвращаемое значение:
//   - Ссылка 
//
Функция ПолучитьЕдинственнуюОрганизацию() Экспорт

	ОрганизацияСсылка = Справочники.инкОрганизации.ПустаяСсылка();

	ОрганизацииТаблица = ПолучитьСписокОрганизаций();
	Если ОрганизацииТаблица.Количество() = 1 Тогда
		ОрганизацияСсылка = ОрганизацииТаблица[0].Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияСсылка;

КонецФункции 

// Функция - Получить список организаций
// 
// Возвращаемое значение:
//   - Таблица значений;
//
Функция ПолучитьСписокОрганизаций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкОрганизации.Ссылка КАК Ссылка,
		|	инкОрганизации.ИНН КАК ИНН,
		|	инкОрганизации.КПП КАК КПП,
		|	инкОрганизации.Наименование КАК Наименование
		|ИЗ
		|	Справочник.инкОрганизации КАК инкОрганизации
		|ГДЕ
		|	НЕ инкОрганизации.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОрганизацииТаблица = РезультатЗапроса.Выгрузить();
	
	Возврат ОрганизацииТаблица;
	
КонецФункции

// Функция - Кадровые данные руководителя
//
// Параметры:
//  ОрганизацияСсылка	 - Ссылка - Организация;
// 
// Возвращаемое значение:
//   - Структура;
//
Функция КадровыеДанныеРуководителя(ОрганизацияСсылка) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ОрганизацияСсылка.Руководитель);

КонецФункции	

// Функция - Кадровые данные бухгалтера
//
// Параметры:
//  ОрганизацияСсылка	 - Ссылка - Организация;
// 
// Возвращаемое значение:
//   - Структура;
//
Функция КадровыеДанныеБухгалтера(ОрганизацияСсылка) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ОрганизацияСсылка.Бухгалтер);

КонецФункции	

// Функция - Кадровые данные кадровика
//
// Параметры:
//  ОрганизацияСсылка	 - Ссылка - Организация;
// 
// Возвращаемое значение:
//   - Структура;
//
Функция КадровыеДанныеКадровика(ОрганизацияСсылка) Экспорт
	
	Возврат инкКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудникаВСтруктуру(ОрганизацияСсылка.Кадровик);

КонецФункции

#КонецОбласти

#КонецЕсли
